#采集数据所需时间:gyr_hea(min):14.3,14.5,16.4,14.6,21.8,16.3,13.7,15.1,14.6,15.9,12.0,10.4,21.4,15.0,20.3,30.5, 11.3,0,
#16.1,9.8,14.7,14.6,30.9,12.1,12.9,15.1,11.2,14.4,20.9

# matplotlib模块绘制直方图
import matplotlib.pyplot as plt
# 读入数据
time = [14.3,14.5,16.4,14.6,21.8,16.3,13.7,15.1,14.6,15.9,12.0,10.4,21.4,15.0,20.3,30.5,11.3,0,
        16.1,9.8,14.7,14.6,30.9,12.1,12.9,15.1,11.2,14.4,20.9]
# 绘制直方图
plt.hist(x = time, # 指定绘图数据
         bins = 29, # 指定直方图中条块的个数
         color = 'steelblue', # 指定直方图的填充色
         edgecolor = 'black' # 指定直方图的边框色
         )
# 添加x轴和y轴标签
plt.xlabel('time')
plt.ylabel('frequency')
# 添加标题
plt.title('gyr_hea')
# 显示图形
plt.show()
