#采集数据所需时间：gyr_anx(min):55.8,16.0,21.9,12.9,9.7,12.9,17.1,11.5,17.6,13.4,18.9,16.7,
#0,0, 23.8,14.1,20.1,22.3,13.4,16.6,19.6,21.3,0,0,6.2

import matplotlib.pyplot as plt

# 读入数据
time = [55.8,16.0,21.9,12.9,9.7,12.9,17.1,11.5,17.6,13.4,18.9,16.7,0,0,23.8,14.1,20.1,22.3,
        13.4,16.6,19.6,21.3,0,0,6.2]
# 绘制直方图
plt.hist(x = time, # 指定绘图数据
         bins = 25, # 指定直方图中条块的个数
         color = 'steelblue', # 指定直方图的填充色
         edgecolor = 'black' # 指定直方图的边框色
         )
# 添加x轴和y轴标签
plt.xlabel('time')
plt.ylabel('frequency')
# 添加标题
plt.title('gyr_anx')
# 显示图形
plt.show()
