#采集数据所需时间:14.3、14.4、102.5、84.3、17.1、37.3、139.7、120.6、10.7、21.8、98.5、66.0、22.7、17.6、92.1、
#15.9、14.4、16.2、22.5、13.4、11.9、39.2、93.6、15.3、64.9、81.2、30.9、34.7、84.3、15.1、43.7、23.0、20.8
# matplotlib模块绘制直方图

import matplotlib.pyplot as plt
# 读入数据
time = [14.3,14.4,102.5,84.3,17.1,37.3,139.7,120.6,10.7,21.8,98.5,66.0,22.7,17.6,92.1,15.9,14.4,
        16.2,22.5,13.4,11.9,39.2,93.6,15.3,64.9,81.2,30.9,34.7,84.3,15.1,43.7,23.0,20.8]
# 绘制直方图
plt.hist(x = time, # 指定绘图数据
         bins = 34, # 指定直方图中条块的个数
         color = 'steelblue', # 指定直方图的填充色
         edgecolor = 'black' # 指定直方图的边框色
         )
# 添加x轴和y轴标签
plt.xlabel('time')
plt.ylabel('frequency')
# 添加标题
plt.title('dev_hea')
# 显示图形
plt.show()
