#采集数据所需时间：dev_anx(min):58.8、16.0、22.0、12.9、9.6、12.9、17.0、12.5、18.0、90.2、130.5、13.1、19.0、110.7、6.8、80.9、58.3、
#15.2、23.1、120.0、15.9、15.4、75.4、34.5、19.6、96.0、21.3、15.7、21.7、135.6、97.2、92.0、87.8、10.0
# matplotlib模块绘制直方图

import matplotlib.pyplot as plt
# 读入数据
time = [58.8,16.0,22.0,12.9,9.6,12.9,17.0,12.5,18.0,90.2,130.5,13.1,19.0,110.7,6.8,80.9,58.3,
        15.2,23.1,120.0,15.9,15.4,75.4,34.5,19.6,96.0,21.3,15.7,21.7,135.6,97.2,92.0,87.8,10.0]
# 绘制直方图
plt.hist(x = time, # 指定绘图数据
         bins = 34, # 指定直方图中条块的个数
         color = 'steelblue', # 指定直方图的填充色
         edgecolor = 'black' # 指定直方图的边框色
         )
# 添加x轴和y轴标签
plt.xlabel('time')
plt.ylabel('frequency')
# 添加标题
plt.title('dev_anx')
# 显示图形
plt.show()
