# matplotlib模块绘制直方图
#数据：（min)9.4,16.0,21.9,12.9,9.6,12.5,109.8,11.5,17.6,13.4,18.7,81.2,17.2,16.5,67.0,11.5,11.4,13.7,22.8,19.2,15.9,
     #15.7,11.9,21.9,62.5,17.6,14.8,21.3,15.6,20.1,22.4,13.5,16.6,15.8,17.9,43.6,6.2
import matplotlib.pyplot as plt

# 读入数据
time=[59.4,16.0,21.9,12.9,9.6,12.5,109.8,11.5,17.6,13.4,18.7,81.2,17.2,16.5,67.0,11.5,11.4,13.7,22.8,19.2,15.9,
     15.7,11.9,21.9,62.5,17.6,14.8,21.3,15.6,20.1,22.4,13.5,16.6,15.8,17.9,43.6,6.2]
# 绘制直方图
plt.hist(x = time, # 指定绘图数据
         bins = 41, # 指定直方图中条块的个数
         color = 'steelblue', # 指定直方图的填充色
         edgecolor = 'black' # 指定直方图的边框色
         )
# 添加x轴和y轴标签
plt.xlabel('time')
plt.ylabel('frequency')
# 添加标题
plt.title('acc_anx')
# 显示图形
plt.show()
